package main

// import "fmt"

// func main() {
// 	// 1 решения через +-
// 	a := 3
// 	b := 7
// 	fmt.Printf("до: a:%d, b:%d\n", a, b)

// 	b = a + b // a = 3 b = 10
// 	a = b - a // a = 7 b = 10
// 	b = b - a // a = 3 b = 7

// 	fmt.Printf("после: a:%d, b:%d\n", a, b)

// 	// 2 вариант решения через XOR
// 	x := 3 // (0011 в бинарном виде)
// 	y := 7 // (0111 в бинарном виде)

// 	fmt.Printf("до: x:%d, y:%d\n", x, y)

// 	x = x ^ y
// 	// x становится 3 ^ 7 = 4
// 	// x = 4 (0100)
// 	// y = 7 (0111)

// 	y = x ^ y
// 	// y становится 4 ^ 7 = 3
// 	// x = 4 (0100)
// 	// y = 3 (0011)

// 	x = x ^ y
// 	// x становится 4 ^ 3 = 7
// 	// x = 7 (0111)
// 	// y = 3 (0011)

// 	fmt.Printf("после: x:%d, y:%d\n", x, y)
// }
